Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.GetEnumerator Method
 Returns a pointer to the existing instance of the class. This allows the usage of the foreach statement with AnalysisObjectEnumerator.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
The pointer to the existing instance of the class.
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace